"use client"
import { useState } from "react";
import Header from "../components/common/Header";
import PostVeiw from "../components/common/postVeiw";
import * as S from "./style";

import { useSearchParams } from "next/navigation"
import Application from "../components/pages/recruitment/application";

const Recruitment = () => {
    const router = useSearchParams();
    const postId = router.get('id');
    const [post, setPost] = useState({title:"이것은 제목입니다.", name:"홍길동",
    content:"ㅗㅓㅣㅏㄹ어하ㅣㅓㅇㄹ니ㅏ허ㅏㅣㅇ머라ㅣ헏갸ㅐ저허ㅣㅏ히ㅏ어라ㅣ하ㅣ머ㅣㅏ러먀ㅕㅈ댓겯기ㅕ하ㅓㅗㄹ호ㅓ이라ㅓ아너라ㅣㄴ머이ㅏㄹ헌어리ㅓ니어리ㅓ니ㅏ러ㅓ이ㅏ러ㅣ어니러미ㅏㅓㅎㄷㅁㄱㅎㅗㅓㅣㅏㄹ어하ㅣㅓㅇㄹ니ㅏ허ㅏㅣㅇ머라ㅣ헏갸ㅐ저허ㅣㅏ히ㅏ어라ㅣ하ㅣ머ㅣㅏ러먀ㅕㅈ댓겯기ㅕ하ㅓㅗㄹ호ㅓ이라ㅓ아너라ㅣㄴ머이ㅏㄹ헌어리ㅓ니어리ㅓ니ㅏ러ㅓ이ㅏ러ㅣ어니러미ㅏㅓㅎㄷㅁㄱㅎㅗㅓㅣㅏㄹ어하ㅣㅓㅇㄹ니ㅏ허ㅏㅣㅇ머라ㅣ헏갸ㅐ저허ㅣㅏ히ㅏ어라ㅣ하ㅣ머ㅣㅏ러먀ㅕㅈ댓겯기ㅕ하ㅓㅗㄹ호ㅓ이라ㅓ아너라ㅣㄴ머이ㅏㄹ헌어리ㅓ니어리ㅓ니ㅏ러ㅓ이ㅏ러ㅣ어니러미ㅏㅓㅎㄷㅁㄱㅎㅗㅓㅣㅏㄹ어하ㅣㅓㅇㄹ니ㅏ허ㅏㅣㅇ머라ㅣ헏갸ㅐ저허ㅣㅏ히ㅏ어라ㅣ하ㅣ머ㅣㅏ러먀ㅕㅈ댓겯기ㅕ하ㅓㅗㄹ호ㅓ이라ㅓ아너라ㅣㄴ머이ㅏㄹ헌어리ㅓ니어리ㅓ니ㅏ러ㅓ이ㅏ러ㅣ어니러미ㅏㅓㅎㄷㅁㄱㅎㅗㅓㅣㅏㄹ어하ㅣㅓㅇㄹ니ㅏ허ㅏㅣㅇ머라ㅣ헏갸ㅐ저허ㅣㅏ히ㅏ어라ㅣ하ㅣ머ㅣㅏ러먀ㅕㅈ댓겯기ㅕ하ㅓㅗㄹ호ㅓ이라ㅓ아너라ㅣㄴ머이ㅏㄹ헌어리ㅓ니어리ㅓ니ㅏ러ㅓ이ㅏ러ㅣ어니러미ㅏㅓㅎㄷㅁㄱㅎㅗㅓㅣㅏㄹ어하ㅣㅓㅇㄹ니ㅏ허ㅏㅣㅇ머라ㅣ헏갸ㅐ저허ㅣㅏ히ㅏ어라ㅣ하ㅣ머ㅣㅏ러먀ㅕㅈ댓겯기ㅕ하ㅓㅗㄹ호ㅓ이라ㅓ아너라ㅣㄴ머이ㅏㄹ헌어리ㅓ니어리ㅓ니ㅏ러ㅓ이ㅏ러ㅣ어니러미ㅏㅓㅎㄷㅁㄱㅎㅗㅓㅣㅏㄹ어하ㅣㅓㅇㄹ니ㅏ허ㅏㅣㅇ머라ㅣ헏갸ㅐ저허ㅣㅏ히ㅏ어라ㅣ하ㅣ머ㅣㅏ러먀ㅕㅈ댓겯기ㅕ하ㅓㅗㄹ호ㅓ이라ㅓ아너라ㅣㄴ머이ㅏㄹ헌어리ㅓ니어리ㅓ니ㅏ러ㅓ이ㅏ러ㅣ어니러미ㅏㅓㅎㄷㅁㄱㅎㅗㅓㅣㅏㄹ어하ㅣㅓㅇㄹ니ㅏ허ㅏㅣㅇ머라ㅣ헏갸ㅐ저허ㅣㅏ히ㅏ어라ㅣ하ㅣ머ㅣㅏ러먀ㅕㅈ댓겯기ㅕ하ㅓㅗㄹ호ㅓ이라ㅓ아너라ㅣㄴ머이ㅏㄹ헌어리ㅓ니어리ㅓ니ㅏ러ㅓ이ㅏ러ㅣ어니러미ㅏㅓㅎㄷㅁㄱㅎㅗㅓㅣㅏㄹ어하ㅣㅓㅇㄹ니ㅏ허ㅏㅣㅇ머라ㅣ헏갸ㅐ저허ㅣㅏ히ㅏ어라ㅣ하ㅣ머ㅣㅏ러먀ㅕㅈ댓겯기ㅕ하ㅓㅗㄹ호ㅓ이라ㅓ아너라ㅣㄴ머이ㅏㄹ헌어리ㅓ니어리ㅓ니ㅏ러ㅓ이ㅏ러ㅣ어니러미ㅏㅓㅎㄷㅁㄱㅎㅗㅓㅣㅏㄹ어하ㅣㅓㅇㄹ니ㅏ허ㅏㅣㅇ머라ㅣ헏갸ㅐ저허ㅣㅏ히ㅏ어라ㅣ하ㅣ머ㅣㅏ러먀ㅕㅈ댓겯기ㅕ하ㅓㅗㄹ호ㅓ이라ㅓ아너라ㅣㄴ머이ㅏㄹ헌어리ㅓ니어리ㅓ니ㅏ러ㅓ이ㅏ러ㅣ어니러미ㅏㅓㅎㄷㅁㄱㅎㅗㅓㅣㅏㄹ어하ㅣㅓㅇㄹ니ㅏ허ㅏㅣㅇ머라ㅣ헏갸ㅐ저허ㅣㅏ히ㅏ어라ㅣ하ㅣ머ㅣㅏ러먀ㅕㅈ댓겯기ㅕ하ㅓㅗㄹ호ㅓ이라ㅓ아너라ㅣㄴ머이ㅏㄹ헌어리ㅓ니어리ㅓ니ㅏ러ㅓ이ㅏ러ㅣ어니러미ㅏㅓㅎㄷㅁㄱㅎㅗㅓㅣㅏㄹ어하ㅣㅓㅇㄹ니ㅏ허ㅏㅣㅇ머라ㅣ헏갸ㅐ저허ㅣㅏ히ㅏ어라ㅣ하ㅣ머ㅣㅏ러먀ㅕㅈ댓겯기ㅕ하ㅓㅗㄹ호ㅓ이라ㅓ아너라ㅣㄴ머이ㅏㄹ헌어리ㅓ니어리ㅓ니ㅏ러ㅓ이ㅏ러ㅣ어니러미ㅏㅓㅎㄷㅁㄱㅎㅗㅓㅣㅏㄹ어하ㅣㅓㅇㄹ니ㅏ허ㅏㅣㅇ머라ㅣ헏갸ㅐ저허ㅣㅏ히ㅏ어라ㅣ하ㅣ머ㅣㅏ러먀ㅕㅈ댓겯기ㅕ하ㅓㅗㄹ호ㅓ이라ㅓ아너라ㅣㄴ머이ㅏㄹ헌어리ㅓ니어리ㅓ니ㅏ러ㅓ이ㅏ러ㅣ어니러미ㅏㅓㅎㄷㅁㄱㅎㅗㅓㄹ헌어리ㅓ니어리ㅓ니ㅏ러ㅓ이ㅏ러ㅣ어니러미ㅏㅓㅎㄷㅁㄱㅎㅗㅓㄹ헌어리ㅓ니어리ㅓ니ㅏ러ㅓ이ㅏ러ㅣ어니러미ㅏㅓㅎㄷㅁㄱㅎㅗㅓㄹ헌어리ㅓ니어리ㅓ니ㅏ러ㅓ이ㅏ러ㅣ어니러미ㅏㅓㅎㄷㅁㄱㅎㅗㅓㄹ헌어리ㅓ니어리ㅓ니ㅏ러ㅓ이ㅏ러ㅣ어니러미ㅏㅓㅎㄷㅁㄱㅎㅗㅓㄹ헌어리ㅓ니어리ㅓ니ㅏ러ㅓ이ㅏ러ㅣ어니러미ㅏㅓㅎㄷㅁㄱㅎㅗㅓㄹ헌어리ㅓ니어리ㅓ니ㅏ러ㅓ이ㅏ러ㅣ어니러미ㅏㅓㅎㄷㅁㄱㅎㅗㅓㄹ헌어리ㅓ니어리ㅓ니ㅏ러ㅓ이ㅏ러ㅣ어니러미ㅏㅓㅎㄷㅁㄱㅎㅗㅓㄹ헌어리ㅓ니어리ㅓ니ㅏ러ㅓ이ㅏ러ㅣ어니러미ㅏㅓㅎㄷㅁㄱㅎㅗㅓㄹ헌어리ㅓ니어리ㅓ니ㅏ러ㅓ이ㅏ러ㅣ어니러미ㅏㅓㅎㄷㅁㄱㅎㅗㅓㄹ헌어리ㅓ니어리ㅓ니ㅏ러ㅓ이ㅏ러ㅣ어니러미ㅏㅓㅎㄷㅁㄱㅎㅗㅓㄹ헌어리ㅓ니어리ㅓ니ㅏ러ㅓ이ㅏ러ㅣ어니러미ㅏㅓㅎㄷㅁㄱㅎㅗㅓㄹ헌어리ㅓ니어리ㅓ니ㅏ러ㅓ이ㅏ러ㅣ어니러미ㅏㅓㅎㄷㅁㄱㅎㅗㅓㄹ헌어리ㅓ니어리ㅓ니ㅏ러ㅓ이ㅏ러ㅣ어니러미ㅏㅓㅎㄷㅁㄱㅎㅗㅓㄹ헌어리ㅓ니어리ㅓ니ㅏ러ㅓ이ㅏ러ㅣ어니러미ㅏㅓㅎㄷㅁㄱㅎㅗㅓㄹ헌어리ㅓ니어리ㅓ니ㅏ러ㅓ이ㅏ러ㅣ어니러미ㅏㅓㅎㄷㅁㄱㅎㅗㅓㄹ헌어리ㅓ니어리ㅓ니ㅏ러ㅓ이ㅏ러ㅣ어니러미ㅏㅓㅎㄷㅁㄱㅎㅗㅓㄹ헌어리ㅓ니어리ㅓ니ㅏ러ㅓ이ㅏ러ㅣ어니러미ㅏㅓㅎㄷㅁㄱㅎㅗㅓㄹ헌어리ㅓ니어리ㅓ니ㅏ러ㅓ이ㅏ러ㅣ어니러미ㅏㅓㅎㄷㅁㄱㅎㅗㅓㄹ헌어리ㅓ니어리ㅓ니ㅏ러ㅓ이ㅏ러ㅣ어니러미ㅏㅓㅎㄷㅁㄱㅎㅗㅓㄹ헌어리ㅓ니어리ㅓ니ㅏ러ㅓ이ㅏ러ㅣ어니러미ㅏㅓㅎㄷㅁㄱㅎㅗㅓㄹ헌어리ㅓ니어리ㅓ니ㅏ러ㅓ이ㅏ러ㅣ어니러미ㅏㅓㅎㄷㅁㄱㅎㅗㅓㄹ헌어리ㅓ니어리ㅓ니ㅏ러ㅓ이ㅏ러ㅣ어니러미ㅏㅓㅎㄷㅁㄱㅎㅗㅓㄹ헌어리ㅓ니어리ㅓ니ㅏ러ㅓ이ㅏ러ㅣ어니러미ㅏㅓㅎㄷㅁㄱㅎㅗㅓㄹ헌어리ㅓ니어리ㅓ니ㅏ러ㅓ이ㅏ러ㅣ어니러미ㅏㅓㅎㄷㅁㄱㅎㅗㅓㄹ헌어리ㅓ니어리ㅓ니ㅏ러ㅓ이ㅏ러ㅣ어니러미ㅏㅓㅎㄷㅁㄱㅎㅗㅓㄹ헌어리ㅓ니어리ㅓ니ㅏ러ㅓ이ㅏ러ㅣ어니러미ㅏㅓㅎㄷㅁㄱㅎㅗㅓㄹ헌어리ㅓ니어리ㅓ니ㅏ러ㅓ이ㅏ러ㅣ어니러미ㅏㅓㅎㄷㅁㄱㅎㅗㅓㄹ헌어리ㅓ니어리ㅓ니ㅏ러ㅓ이ㅏ러ㅣ어니러미ㅏㅓㅎㄷㅁㄱㅎㅗㅓㄹ헌어리ㅓ니어리ㅓ니ㅏ러ㅓ이ㅏ러ㅣ어니러미ㅏㅓㅎㄷㅁㄱㅎㅗㅓㄹ헌어리ㅓ니어리ㅓ니ㅏ러ㅓ이ㅏ러ㅣ어니러미ㅏㅓㅎㄷㅁㄱㅎㅗㅓㄹ헌어리ㅓ니어리ㅓ니ㅏ러ㅓ이ㅏ러ㅣ어니러미ㅏㅓㅎㄷㅁㄱㅎㅗㅓㄹ헌어리ㅓ니어리ㅓ니ㅏ러ㅓ이ㅏ러ㅣ어니러미ㅏㅓㅎㄷㅁㄱㅎㅗㅓㄹ헌어리ㅓ니어리ㅓ니ㅏ러ㅓ이ㅏ러ㅣ어니러미ㅏㅓㅎㄷㅁㄱㅎㅗㅓㄹ헌어리ㅓ니어리ㅓ니ㅏ러ㅓ이ㅏ러ㅣ어니러미ㅏㅓㅎㄷㅁㄱㅎㅗㅓㄹ헌어리ㅓ니어리ㅓ니ㅏ러ㅓ이ㅏ러ㅣ어니러미ㅏㅓㅎㄷㅁㄱㅎㅗㅓㄹ헌어리ㅓ니어리ㅓ니ㅏ러ㅓ이ㅏ러ㅣ어니러미ㅏㅓㅎㄷㅁㄱㅎㅗㅓㅣㅏㄹ어하ㅣㅓㅇㄹ니ㅏ허ㅏㅣㅇ머라ㅣ헏갸ㅐ저허ㅣㅏ히ㅏ어라ㅣ하ㅣ머ㅣㅏ러먀ㅕㅈ댓겯기ㅕ하ㅓㅗㄹ호ㅓ이라ㅓ아너라ㅣㄴ머이ㅏㄹ헌어리ㅓ니어리ㅓ니ㅏ러ㅓ이ㅏ러ㅣ어니러미ㅏㅓㅎㄷㅁㄱㅎ"})

    return(
        <S.FlexBox>
            <Header/>
                <S.FlexBox2>
                <S.Container>
                    <PostVeiw title={post.title} name={post.name} content={post.content}/>
                    <Application/>
                </S.Container>  
            </S.FlexBox2>
        </S.FlexBox>
    )
}

export default Recruitment